app/views/states/_form.html.erb

SELECT "countries".* FROM "countries"
---
                <%= form.label :country_id, "Country", class: "form-label" %>
                <%= form.collection_select :country_id, Country.all, :id, :name, { prompt: 'Select a country' }, { class: "form-select" } %>