app/datatables/city_datatable.rb

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cities".* FROM "cities" ORDER BY countries.name ASC NULLS LAST LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def view_columns
    # Declare strings in this format: ModelName.column_name
    # or in aliased_join_table.column_name format
    @view_columns ||= {
      country_id: { source: "City.country.name", cond: :eq },
      state_id: { source: "City.state.name", cond: :eq },
      name: { source: "City.name", cond: :like, searchable: true, orderable: true },
      zip: { source: "City.zip", cond: :like, nulls_last: true },
      population: { source: "City.population" },
      action: { source: "", searchable: false, orderable: false },
      # id: { source: "User.id", cond: :eq },


SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def data
    records.map do |record|
      {
        country_id: record.country.name,
        state_id: record.state.name,
        name: record.name,
        zip: record.zip,
        population: record.population,
        action: action(record),
        # example: