app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
    def index
        @cities = City.all

SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
      def show
        @city = City.find(params[:id])

SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def edit
        @city = City.find(params[:id])

INSERT INTO "cities" ("country_id", "state_id", "name", "zip", "population", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["country_id", 2], ["state_id", 4], ["name", "Surat"], ["zip", "653485"], ["population", 3597], ["created_at", "2023-12-25 09:52:08.043544"], ["updated_at", "2023-12-25 09:52:08.043544"]]
---
      def create
        @city = City.new(city_params)

        if @city.save

SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cities" SET "country_id" = $1, "state_id" = $2, "name" = $3, "zip" = $4, "population" = $5, "updated_at" = $6 WHERE "cities"."id" = $7  [["country_id", 2], ["state_id", 4], ["name", "Bopal"], ["zip", "382350"], ["population", 45288], ["updated_at", "2023-12-29 06:46:40.358858"], ["id", 1]]
---
      def update
        @city = City.find(params[:id])

        if @city.update(city_params)