app/controllers/countries_controller.rb

SELECT "countries".* FROM "countries"
SELECT COUNT(*) FROM "countries"
---
    def index
        @countries = Country.all

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
      def show
        @country = Country.find(params[:id])

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
      def edit
        @country = Country.find(params[:id])

INSERT INTO "countries" ("name", "code", "is_active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Canada "], ["code", "CA"], ["is_active", false], ["created_at", "2023-12-25 07:36:50.824595"], ["updated_at", "2023-12-25 07:36:50.824595"]]
---
      def create
        @country = Country.new(country_params)

        if @country.save

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "countries" SET "is_active" = $1, "updated_at" = $2 WHERE "countries"."id" = $3  [["is_active", false], ["updated_at", "2023-12-21 11:49:26.862852"], ["id", 3]]
---
      def update
        @country = Country.find(params[:id])

        if @country.update(country_params)

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def destroy
        @country = Country.find(params[:id])