app/controllers/states_controller.rb

SELECT "states".* FROM "states"
---
    def index
        @states = State.all

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
      def show
        @state = State.find(params[:id])

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
      def edit
        @state = State.find(params[:id])

INSERT INTO "states" ("country_id", "name", "abbreviation", "capital", "is_active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["country_id", 2], ["name", "Bihar"], ["abbreviation", "BH"], ["capital", "Patna"], ["is_active", true], ["created_at", "2023-12-25 09:37:54.025864"], ["updated_at", "2023-12-25 09:37:54.025864"]]
---
      def create
        @state = State.new(state_params)

        if @state.save

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "states" SET "capital" = $1, "updated_at" = $2 WHERE "states"."id" = $3  [["capital", "defeferrr"], ["updated_at", "2023-12-21 12:06:30.502413"], ["id", 2]]
---
      def update
        @state = State.find(params[:id])

        if @state.update(state_params)

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "states" WHERE "states"."id" = $1  [["id", 1]]
---
      def destroy
        @state = State.find(params[:id])
        @state.destroy

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def fetch_states
        country = Country.find(params[:country_id])