app/views/cities/_form.html.erb

                <%= form.label :country_id, class: "me-4" %>
                <%= form.collection_select :country_id, Country.all, :id, :name, { prompt: 'Select a Country' }, { id: 'country-select', class: "form-select" } %>
---
SELECT "countries".* FROM "countries"

                <%= form.label :state_id, class: "me-4" %>
                <%= form.collection_select :state_id, State.all, :id, :name, { prompt: 'Select a State' }, { id: 'state-select', class: "form-select" } %>
---
SELECT "states".* FROM "states"

                    var stateSelect = document.getElementById('state-select');
                    var states = <%= raw State.all.group_by(&:country_id).to_json %>;
---
SELECT "states".* FROM "states"