app/models/country.rb

SELECT "countries".* FROM "countries"
---
    def self.to_csv
    posts = all
    CSV.generate do |csv|
    csv << column_names
    posts.each do |post|

SELECT 1 AS one FROM "countries" WHERE LOWER("countries"."name") = LOWER($1) AND "countries"."id" != $2 LIMIT $3  [["name", "India"], ["id", 2], ["LIMIT", 1]]
UPDATE "countries" SET "created_at" = $1, "updated_at" = $2 WHERE "countries"."id" = $3  [["created_at", nil], ["updated_at", nil], ["id", 16]]
INSERT INTO "countries" ("id", "name", "code", "is_active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["id", 16], ["name", "Argentina"], ["code", "AG"], ["is_active", true], ["created_at", "2024-01-09 06:31:10.622152"], ["updated_at", "2024-01-09 06:31:10.622152"]]
UPDATE "countries" SET "created_at" = $1, "updated_at" = $2 WHERE "countries"."id" = $3  [["created_at", "2023-12-20 08:22:03"], ["updated_at", "2023-12-20 08:22:03"], ["id", 2]]
---
def self.import_from_csv(file)
  CSV.foreach(file.path, headers: true) do |row|
    country_attributes = {}

    row.to_hash.each do |key, value|
      if Country.column_names.include?(key.downcase)
        country_attributes[key.downcase.to_sym] = value
      end
    end
    country = find_or_initialize_by(code: country_attributes[:code])
    country.update(country_attributes)
    country.save!