app/models/state.rb

def self.to_csv
 posts = all
 CSV.generate do |csv|
   csv << column_names
   posts.each do |post|
---
SELECT "states".* FROM "states"